In [65]:
import numpy as np
import pandas as pd

In [66]:
dict1={
    "name":['Harry', 'Rohan', 'Skillf', 'Shubh'],
    "marks":[92,34, 24, 17],
    "city":['Rampur','Kolkata', 'Bareilly', 'Antartica']
}

In [67]:
df=pd.DataFrame(dict1)

In [68]:
df

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [69]:
#to see the top most data
df.head(2)

    name  marks     city
0  Harry     92   Rampur
1  Rohan     34  Kolkata

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [71]:
#the numerical data are shown in details, like marks
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [72]:
#to convert into the csv file
df.to_csv('friends.csv')

In [73]:
#to hide the index
df.to_csv('friends_index_false.csv', index=False)

In [74]:
#to see the last most data
df.tail(1)

    name  marks       city
3  Shubh     17  Antartica

In [75]:
read=pd.read_csv('demo.csv')

In [76]:
read

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [77]:
# to read only the particular row like name, city etc
read['name']

0     Harry
1     Rohan
2    Skillf
3     Shubh
Name: name, dtype: object

In [78]:
# we even can read the data in the particular index like:

read['name'][0]

'Harry'

In [79]:
read['name'][0]='Harry'

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/454520273.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['name'][0]='Harry'

In [80]:
# even can change the data,
read['marks'][0]=99
# although it is showing the warning, but the code has been  updated!!

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/2093934311.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  read['marks'][0]=99
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/2093934311.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['marks'][0]=99

In [81]:
read

     name  marks       city
0   Harry     99     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [82]:
#to convert in to a csv file
read.to_csv('read1.csv', index=False)

In [83]:
#it also allow to custom index
read.index=['first', 'Second','Third', 'Fourt']

In [84]:
read

          name  marks       city
first    Harry     99     Rampur
Second   Rohan     34    Kolkata
Third   Skillf     24   Bareilly
Fourt    Shubh     17  Antartica

In [85]:
#creating a data frame in the form of row and columns
newdf =pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [86]:
#printning the data frame
newdf

            0         1         2         3         4
0    0.640187  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [87]:
#to know the type 
type(newdf)

pandas.core.frame.DataFrame

In [88]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.523295    0.484691    0.504392    0.486163    0.483028
std      0.290678    0.279662    0.282579    0.291243    0.280752
min      0.000021    0.004870    0.000823    0.002354    0.006477
25%      0.266834    0.246298    0.257391    0.237781    0.252287
50%      0.529250    0.485804    0.507664    0.480227    0.468574
75%      0.782628    0.727400    0.736753    0.742413    0.716080
max      0.999748    0.995346    0.999697    0.999440    0.999838

In [89]:
#to get the info about the df
newdf.head()

          0         1         2         3         4
0  0.640187  0.950294  0.531974  0.696225  0.150286
1  0.506748  0.168033  0.371299  0.486183  0.362872
2  0.168443  0.154111  0.416306  0.844613  0.052433
3  0.836735  0.079699  0.360891  0.249850  0.247066
4  0.806097  0.804068  0.549839  0.783016  0.225851

In [90]:
#to know the data type
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [91]:
newdf[0][0]="Bishal Shah"

/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/674700252.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="Bishal Shah"
/var/folders/yy/dttrjnps6cg07nj84419gtmw0000gn/T/ipykernel_16937/674700252.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Bishal Shah' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="Bishal Shah"

In [92]:
newdf

               0         1         2         3         4
0    Bishal Shah  0.950294  0.531974  0.696225  0.150286
1       0.506748  0.168033  0.371299  0.486183  0.362872
2       0.168443  0.154111  0.416306  0.844613  0.052433
3       0.836735  0.079699  0.360891  0.249850  0.247066
4       0.806097  0.804068  0.549839  0.783016  0.225851
..           ...       ...       ...       ...       ...
329     0.874791  0.408480  0.080104  0.791089  0.273577
330     0.895248  0.237868  0.454202  0.564535  0.630558
331     0.775171  0.845684  0.256717  0.999440  0.163011
332     0.953615  0.765467  0.497550  0.236803  0.777325
333     0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [93]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [94]:
#printing the index
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [95]:
#columns
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [96]:
#to convert into the numpy
newdf.to_numpy()

array([['Bishal Shah', 0.9502943525081492, 0.5319741926522918,
        0.6962251583710054, 0.150286442842404],
       [0.5067476845706392, 0.1680333638847631, 0.37129937621247966,
        0.48618342185596863, 0.3628718224789763],
       [0.16844275178466273, 0.15411120057368144, 0.4163058424013435,
        0.8446134896519745, 0.05243257129092205],
       ...,
       [0.7751713602646635, 0.8456843414508923, 0.2567172676997199,
        0.9994396075632318, 0.1630113532832984],
       [0.9536154584937504, 0.7654673528147137, 0.4975498883060758,
        0.2368033972986473, 0.7773254017446252],
       [0.9882676835275636, 0.3342588339936292, 0.44969588172866914,
        0.49633906045197307, 0.5753075961793318]],
      shape=(334, 5), dtype=object)

In [97]:
newdf[0][0]=np.random.rand()

In [98]:
newdf

            0         1         2         3         4
0    0.970701  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [99]:
newdf.to_numpy()

array([[0.970701052305767, 0.9502943525081492, 0.5319741926522918,
        0.6962251583710054, 0.150286442842404],
       [0.5067476845706392, 0.1680333638847631, 0.37129937621247966,
        0.48618342185596863, 0.3628718224789763],
       [0.16844275178466273, 0.15411120057368144, 0.4163058424013435,
        0.8446134896519745, 0.05243257129092205],
       ...,
       [0.7751713602646635, 0.8456843414508923, 0.2567172676997199,
        0.9994396075632318, 0.1630113532832984],
       [0.9536154584937504, 0.7654673528147137, 0.4975498883060758,
        0.2368033972986473, 0.7773254017446252],
       [0.9882676835275636, 0.3342588339936292, 0.44969588172866914,
        0.49633906045197307, 0.5753075961793318]],
      shape=(334, 5), dtype=object)

In [100]:
#to convert the row->column and the vice versa
#simply transpose
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.970701,0.506748,0.168443,0.836735,0.806097,0.788289,0.287638,0.417454,0.667691,0.361725,...,0.263551,0.533347,0.416637,0.675299,0.544095,0.874791,0.895248,0.775171,0.953615,0.988268
1,0.950294,0.168033,0.154111,0.079699,0.804068,0.467049,0.792522,0.776176,0.808965,0.746028,...,0.955676,0.837551,0.709453,0.73065,0.895955,0.40848,0.237868,0.845684,0.765467,0.334259
2,0.531974,0.371299,0.416306,0.360891,0.549839,0.737187,0.449074,0.916888,0.849125,0.278789,...,0.970265,0.824556,0.754466,0.427941,0.18895,0.080104,0.454202,0.256717,0.49755,0.449696
3,0.696225,0.486183,0.844613,0.24985,0.783016,0.573377,0.907373,0.424116,0.752517,0.212093,...,0.719658,0.927233,0.240714,0.588239,0.194616,0.791089,0.564535,0.99944,0.236803,0.496339
4,0.150286,0.362872,0.052433,0.247066,0.225851,0.709801,0.048659,0.427738,0.814446,0.226037,...,0.388464,0.808839,0.432852,0.491778,0.183025,0.273577,0.630558,0.163011,0.777325,0.575308

In [101]:
#to reverse sort the rows
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.988268  0.334259  0.449696  0.496339  0.575308
332  0.953615  0.765467  0.497550  0.236803  0.777325
331  0.775171  0.845684  0.256717  0.999440  0.163011
330  0.895248  0.237868  0.454202  0.564535  0.630558
329  0.874791  0.408480  0.080104  0.791089  0.273577
..        ...       ...       ...       ...       ...
4    0.806097  0.804068  0.549839  0.783016  0.225851
3    0.836735  0.079699  0.360891  0.249850  0.247066
2    0.168443  0.154111  0.416306  0.844613  0.052433
1    0.506748  0.168033  0.371299  0.486183  0.362872
0    0.970701  0.950294  0.531974  0.696225  0.150286

[334 rows x 5 columns]

In [102]:
#to reverse sort the columns
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.150286  0.696225  0.531974  0.950294  0.970701
1    0.362872  0.486183  0.371299  0.168033  0.506748
2    0.052433  0.844613  0.416306  0.154111  0.168443
3    0.247066  0.249850  0.360891  0.079699  0.836735
4    0.225851  0.783016  0.549839  0.804068  0.806097
..        ...       ...       ...       ...       ...
329  0.273577  0.791089  0.080104  0.408480  0.874791
330  0.630558  0.564535  0.454202  0.237868  0.895248
331  0.163011  0.999440  0.256717  0.845684  0.775171
332  0.777325  0.236803  0.497550  0.765467  0.953615
333  0.575308  0.496339  0.449696  0.334259  0.988268

[334 rows x 5 columns]

In [103]:
newdf

            0         1         2         3         4
0    0.970701  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [104]:
#to access all the elements at 0th column
newdf[0]

0      0.970701
1      0.506748
2      0.168443
3      0.836735
4      0.806097
         ...
329    0.874791
330    0.895248
331    0.775171
332    0.953615
333    0.988268
Name: 0, Length: 334, dtype: object

In [105]:
#inorder to remove the warning, we use .lock[0][0] for the replacement of the value
newdf.loc[0,0]=11

In [106]:
newdf.head()

          0         1         2         3         4
0        11  0.950294  0.531974  0.696225  0.150286
1  0.506748  0.168033  0.371299  0.486183  0.362872
2  0.168443  0.154111  0.416306  0.844613  0.052433
3  0.836735  0.079699  0.360891  0.249850  0.247066
4  0.806097  0.804068  0.549839  0.783016  0.225851

In [107]:
#to set the columns name
newdf.columns=list("ABCDE")

In [108]:
newdf

            A         B         C         D         E
0          11  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [109]:
#so now if we want to access 11, we need to [0,'A']

In [110]:
newdf

            A         B         C         D         E
0          11  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [111]:
#to remove the last column
newdf.drop(0,axis=0)

            A         B         C         D         E
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
5    0.788289  0.467049  0.737187  0.573377  0.709801
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[333 rows x 5 columns]

In [112]:
newdf.loc[0,'A']=90

In [113]:
newdf

            A         B         C         D         E
0          90  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [114]:
newdf.loc[0,'A']=901
newdf

            A         B         C         D         E
0         901  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [115]:
newdf.head()

          A         B         C         D         E
0       901  0.950294  0.531974  0.696225  0.150286
1  0.506748  0.168033  0.371299  0.486183  0.362872
2  0.168443  0.154111  0.416306  0.844613  0.052433
3  0.836735  0.079699  0.360891  0.249850  0.247066
4  0.806097  0.804068  0.549839  0.783016  0.225851

In [116]:
newdf.drop(1, axis=0)#removed the data of  1st row

            A         B         C         D         E
0         901  0.950294  0.531974  0.696225  0.150286
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
5    0.788289  0.467049  0.737187  0.573377  0.709801
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[333 rows x 5 columns]

In [117]:
newdf.drop(3,axis=0)#removed the data of  3rd  row

            A         B         C         D         E
0         901  0.950294  0.531974  0.696225  0.150286
1    0.506748  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
4    0.806097  0.804068  0.549839  0.783016  0.225851
5    0.788289  0.467049  0.737187  0.573377  0.709801
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[333 rows x 5 columns]

In [118]:
newdf.drop('D', axis=1)#the axis=1 denotes column and 0 denotes row
newdf1=newdf.drop('A', axis=1)#the axis=1 denotes column and 0 denotes row
newdf1

            B         C         D         E
0    0.950294  0.531974  0.696225  0.150286
1    0.168033  0.371299  0.486183  0.362872
2    0.154111  0.416306  0.844613  0.052433
3    0.079699  0.360891  0.249850  0.247066
4    0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...
329  0.408480  0.080104  0.791089  0.273577
330  0.237868  0.454202  0.564535  0.630558
331  0.845684  0.256717  0.999440  0.163011
332  0.765467  0.497550  0.236803  0.777325
333  0.334259  0.449696  0.496339  0.575308

[334 rows x 4 columns]

In [119]:
newdf.head(3)

          A         B         C         D         E
0       901  0.950294  0.531974  0.696225  0.150286
1  0.506748  0.168033  0.371299  0.486183  0.362872
2  0.168443  0.154111  0.416306  0.844613  0.052433

In [126]:
newdf.loc[1,'A']=90

In [127]:
newdf.head()

          A         B         C         D         E
0        90  0.950294  0.531974  0.696225  0.150286
1        90  0.168033  0.371299  0.486183  0.362872
2  0.168443  0.154111  0.416306  0.844613  0.052433
3  0.836735  0.079699  0.360891  0.249850  0.247066
4  0.806097  0.804068  0.549839  0.783016  0.225851

In [132]:
newdf.drop(0, axis=0)#0->row & 1-> columns

            A         B         C         D         E
1          90  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
5    0.788289  0.467049  0.737187  0.573377  0.709801
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[333 rows x 5 columns]

In [133]:
newdf

            A         B         C         D         E
0          90  0.950294  0.531974  0.696225  0.150286
1          90  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [137]:
newdf.loc[[1,2,3,4,5,36],['C','D','E']] #to access particular no. of rows and columns

           C         D         E
1   0.371299  0.486183  0.362872
2   0.416306  0.844613  0.052433
3   0.360891  0.249850  0.247066
4   0.549839  0.783016  0.225851
5   0.737187  0.573377  0.709801
36  0.358267  0.468262  0.694253

In [138]:
newdf

            A         B         C         D         E
0          90  0.950294  0.531974  0.696225  0.150286
1          90  0.168033  0.371299  0.486183  0.362872
2    0.168443  0.154111  0.416306  0.844613  0.052433
3    0.836735  0.079699  0.360891  0.249850  0.247066
4    0.806097  0.804068  0.549839  0.783016  0.225851
..        ...       ...       ...       ...       ...
329  0.874791  0.408480  0.080104  0.791089  0.273577
330  0.895248  0.237868  0.454202  0.564535  0.630558
331  0.775171  0.845684  0.256717  0.999440  0.163011
332  0.953615  0.765467  0.497550  0.236803  0.777325
333  0.988268  0.334259  0.449696  0.496339  0.575308

[334 rows x 5 columns]

In [140]:
newdf.loc[:,['A']]  #to access all the rows of A

            A
0          90
1          90
2    0.168443
3    0.836735
4    0.806097
..        ...
329  0.874791
330  0.895248
331  0.775171
332  0.953615
333  0.988268

[334 rows x 1 columns]

In [141]:
newdf.loc[[7],:] #to access all the columns of 7

          A         B         C         D         E
7  0.417454  0.776176  0.916888  0.424116  0.427738